<template>
  <div>
    <h3 class="tc mb10 mt30">企业网银安全提示</h3>
    <div class="tip">
      <p>
        为维护双方利益，规范双方业务行为，四川农信（以下简称乙方）和自愿在乙方网站上使用网上银行服务的用户（以下简称甲方）本着平等互利的原则，就网上银行服务相关事宜达成如下协议：
      </p>
      <p>
        一、网上银行的定义及服务范围
      </p>
      <p>
        "网上银行”是指乙方通过互联网或其它公共信息网络为企事业单位和个人提供的网上金融服务。本协议中的网上银行指乙方提供的网上银行个人版或企业版。
      </p>
      <p>

        二、网上银行的交易方式
      </p>
      <p>

        乙方提供数字证书、动态密码、静态密码等安全认证方式（下称安全认证方式）。并根据各交易风险程度不同，提供安全方式组合。甲方选用乙方提供的安全认证方式并以其制作网上银行交易指令。
      </p>
      <p>

        双方均认可网上银行业务中采取安全认证方式的合法性、有效性和安全性。凡是凭甲方选用的安全认证方式进行的网上银行业务操作，均视为甲方所为。
      </p>
      <p>

        三、甲方的权利与义务
      </p>
      <p>

        1、在使用乙方企业网上银行前阅读乙方企业网上银行相关的章程、业务规则、功能说明等，并按照企业需要选择授权方式，设置“企业网上银行”的管理员、操作员、授权员，如需变更，必须及时调整，否则，由此造成的损失由甲方承担。
      </p>
      <p>

        2、甲方的合法签名人有责任妥善保管安全认证方式及其载体的密码、登录密码、交易密码等，并保证对无论是将之提供给他人使用，或因泄密等任何原因由本人或他人使用而完成的一切金融交易承担责任。
      </p>
      <p>

        3、按照乙方规定的网上银行注册程序申请注册，正确填写电子渠道签约申请/维护表并提供有关资料。甲方应保证所填写的网上银行业务申请书和所提供的资料真实、准确、完整，并对此承担责任。
      </p>
      <p>

        4、甲方在使用网上银行过程中，有关资料信息如有变更，诸如增删账号、修改企业信息，注销、恢复、补办安全认证方式等，均应按乙方规定的程序办理有关手续，否则由此产生的一切风险和损失由甲方承担。
      </p>
      <p>

        5、甲方挂失的卡、存折等凭证将不能在网上银行办理业务。甲方如需中止网上银行服务，可按乙方规定办理网上银行渠道暂停手续。
      </p>
      <p>

        6、甲方如需终止使用乙方网上银行服务，可按乙方规定及要求办理有关手续，终止本协议。
      </p>
      <p>

        7、遵守乙方网上银行业务的有关业务交易规则及制度，按照乙方的有关操作使用规则、提示及条款正确操作，并对因操作造成的损失承担责任。
      </p>
      <p>

        8、甲方应通过乙方网站（www.4001961200.com）的指定链接登录网上银行系统及使用其各项服务，不得向乙方发送干扰信息或攻击乙方网上银行系统。
      </p>
      <p>

        9、乙方已采用了网上银行登录密码、交易密码等措施保证甲方安全使用乙方网上银行服务。甲方必须通过正确输入乙方域名登录网上银行，通过其他非法链接或不正确域名输入登录的，乙方不承担密码丢失或其他风险带来的不利后果。
      </p>
      <p>

        10、甲方应按照保密的原则设置和保管密码：避免使用姓名、生日、电话号码等与本人明显相关的信息作为密码；不得将本人密码提供给除法律规定外的任何人。甲方安全认证方式在有效期内损毁、锁码、遗失或网上银行相关密码泄露、遗忘，应及时到乙方网点办理更换、解锁、挂失或密码重置手续。办妥上述手续之前所产生的一切后果由甲方承担。
      </p>
      <p>
        11、甲方同意乙方从其账户主动扣收办理网上银行业务应支付的相关费用及数字证书年费，否则乙方有权终止服务。
      </p>
    </div>
    <div class="tc mt20 pb20">
        <el-button @click="goSign">返回</el-button>
    </div>
  </div>
</template>
<script>
export default {
    methods: {
        goSign(){
            window.location.reload();
        }
    }
}
</script>
<style lang="scss" scoped>
.h2 {
  margin: 20px 50px 0px 50px;
}
.tip {
    margin: 0 auto;
    width: 94%;
    line-height: 28px;
}

</style>