export default {
  // 去掉公告类型字段了，前端不展示
  // newsNature: [
  //   {v: '普通公告', k: '1'},
  //   {v: '最新公告（首页广播）', k: '2'},
  // ],
  //公告状态、文档状态、帮助和支持状态
  newsState: [
    {v: '已下架', k: '29'},
    {v: '已上架', k: '20'},
    {v: '已发布', k: '01'},//已审批
    {v: '新建', k: '00'},//待审批
    {v: '已删除', k: '09'},
    {v: '已驳回', k: '19'},
  ],
  //待审批列表中 公告详情状态10=已审批 13=待审批 19=已拒绝
  examineNewsState: [
    {v: '已审批', k: '10'},
    {v: '待审批', k: '13'},
    {v: '已拒绝', k: '19'},
    {v: '新建', k: '00'},
    {v: '已发布', k: '01'},
    {v: '已上架', k: '20'},
    {v: '已下架', k: '29'},
  ],
  actionType: [
    {v: '待审批', k: '1'},
    {v: '拒绝', k: '3'},
  ],
  authFlag:[
    {v: '审批通过', k: '0'},
    {v: '审批驳回', k: '1'},
  ],
  roleStatus:[
    {v: '禁用', k: '0'},
    {v: '激活', k: '1'},
  ],
  isState: [
    {v: '未上传', k: '0'},
    {v: '已上传', k: '1'},
    {v: '不需要', k: '2'},
  ],
};
