export default {
  // 工单状态
  qstStatus: [
    { v: "新建", k: "00" },
    { v: "已受理", k: "01" },
    { v: "已处理", k: "02" },
    { v: "已确认", k: "03" },
    { v: "已关闭", k: "04" }
  ],
  // 工单操作
  qstAction: [
    { v: "受理", k: "00" },
    { v: "处理", k: "01" },
    { v: "确认", k: "02" }
  ],
  // 工单优先级
  priority: [{ v: "重要", k: "1" }, { v: "一般", k: "2" }],
  // 广告栏位
  bannerNature: [
    { v: "首页轮播栏目一", k: "B01001" },
    { v: "首页轮播栏目二", k: "B01002" },
    { v: "首页轮播栏目三", k: "B01003" },
    { v: "我要合作栏目一", k: "B02001" }
  ],
  // 广告状态、公告状态、产品状态、文档状态、帮助和支持状态
  stateList: [
    { v: "新建", k: "00" },
    { v: "已发布", k: "01" },
    { v: "已驳回", k: "19" },
    { v: "已上架", k: "20" },
    { v: "已下架", k: "29" }
  ],
  // 广告状态、公告状态、产品状态、文档状态、帮助和支持状态的字体颜色
  stateListColor: [
    { v: "#000", k: "00" },
    { v: "#2db7f5", k: "01" },
    { v: "pink", k: "19" },
    { v: "#67C23A", k: "20" },
    { v: "#F56C6C", k: "29" }
  ],
  // 商户状态
  merchantState: [
    { v: "待认证", k: "00" },
    { v: "已进件", k: "01" },
    { v: "已面签", k: "10" },
    { v: "未认证", k: "18" },
    { v: "认证驳回", k: "19" },
    { v: "已审核认证", k: "03" },
    { v: "冻结", k: "02" },
    { v: "已销户", k: "09" }
  ],
  // 商户类型
  merchantType: [
    { v: "企业", k: "M" },
    { v: "其他组织", k: "O" },
    { v: "内部机构", k: "D" }
  ],
  // 产品状态
  productState: [
    { v: "绑定已审批", k: "01" },
    { v: "绑定待审批（申请中）", k: "03" },
    { v: "已解绑（终止合作）", k: "05" },
    { v: "已拒绝", k: "09" },
    { v: "已下架", k: "04" }
  ],
  // 产品类型
  piClassfy: [{ v: "API", k: "1" }, { v: "H5", k: "2" }, { v: "SDK", k: "3" }],
  // 案例状态、服务分类状态
  caseState: [
    { v: "删除", k: "-1" },
    { v: "已上架", k: "1" },
    { v: "已下架", k: "3" },
    { v: "新建", k: "0" }
  ],
  // 案例状态、服务分类状态的字体颜色
  caseStateColor: [
    { v: "pink", k: "-1" },
    { v: "green", k: "1" },
    { v: "red", k: "3" },
    { v: "black", k: "0" }
  ],
  // api订阅 api健康状态
  apiHealthState: [{ v: "健康", k: "0" }, { v: "不健康", k: "1" }],
  apiState: [{ v: "已下架", k: "0" }, { v: "已上架", k: "1" }],
  // 断言、过滤器是否必含
  isInput: [{ v: "否", k: "0" }, { v: "是", k: "1" }],
  // 断言、过滤器参数类型
  hasParam: [
    { v: "无参数", k: "0" },
    { v: "有固定参数", k: "1" },
    { v: "无固定参数", k: "2" }
  ],
  // 通信服务健康状态
  health: [
    { v: "健康", k: "0" },
    { v: "停止", k: "1" },
    { v: "部分运行", k: "2" },
    { v: "未知", k: "3" }
  ],
  // *******************  账务中心  ********************
  // 交易类型
  tif_service_code: [
    { v: "充值", k: "101001" },
    { v: "转账", k: "101002" },
    { v: "提现", k: "101003" },
    { v: "清分交易", k: "102001" },
    { v: "结算交易", k: "700002" }
  ],
  // 账户类型
  account_type: [
    { v: "内部账户", k: "00" },
    { v: "余额账户", k: "01" },
    { v: "积分账户", k: "02" },
    { v: "红包账户", k: "03" },
    { v: "基金账户", k: "04" },
    { v: "定期账户", k: "05" },
    { v: "保险账户", k: "06" },
    { v: "信贷账户", k: "07" },
    { v: "保证金账户", k: "08" },
    { v: "授信账户", k: "09" },
    { v: "待结算账户", k: "10" }
  ],
  // 账户状态
  accountState: [
    { v: "关闭", k: "0" },
    { v: "正常", k: "1" },
    { v: "部分冻结", k: "2" },
    { v: "全额冻结", k: "3" },
    { v: "不进不出", k: "4" },
    { v: "结清", k: "5" },
    { v: "预开户", k: "6" }
  ],
  // 冻结类型
  frozenType: [{ v: "永久", k: "1" }, { v: "临时", k: "2" }],
  // 冻结期限
  frozenRecordType: [{ v: "永久", k: "1" }, { v: "临时", k: "2" }],
  // 冻结标识
  frozenFlag: [{ v: "全部", k: "0" }, { v: "部分", k: "1" }],
  // 账户金额冻结原因
  frozenReason: [
    { v: "客户提现需要临时冻结", k: "1" },
    { v: "监管要求对资金临时/永久冻结", k: "2" },
    { v: "购买理财等业务场景需要对资金临时冻结", k: "3" },
    { v: "其它原因", k: "4" }
  ],
  // 账户金额解冻原因
  unfrozenReason: [
    { v: "渠道客户提现完成需要解冻扣除资金", k: "1" },
    { v: "其它场景要求的解冻", k: "2" }
  ],
  // 账务处理类型
  account_handle_type: [
    { v: "充值", k: "1" },
    { v: "提现", k: "2" },
    { v: "转账", k: "3" },
    { v: "收单记账", k: "4" },
    { v: "收单补账", k: "7" },
    { v: "结算", k: "8" },
    { v: "积分下账", k: "15" },
    { v: "积分上账", k: "14" },
    { v: "渠道划转", k: "13" },
    { v: "结算回调失败", k: "10" },
    { v: "结算回调成功", k: "9" },
    { v: "资金渠道内部户划转", k: "12" }
  ],
  // 账户取值类型
  account_parameter_type: [
    { v: "固定账户", k: "1" },
    { v: "参数账户", k: "2" }
  ],
  // 币种取值类型
  currency_parameter_type: [{ v: "固定值", k: "1" }, { v: "参数", k: "2" }],
  // 源账户性质
  orig_acct_type: [{ v: "对私", k: "1" }, { v: "对公", k: "0" }],
  // 账户性质
  acct_type: [{ v: "对私", k: "1" }, { v: "对公", k: "2" }],
  // 交易性质
  tif_trans_nature: [
    { v: "正常交易", k: "01" },
    { v: "冲正交易", k: "02" },
    { v: "撤销交易", k: "03" },
    { v: "退款交易", k: "04" },
    { v: "补单交易", k: "05" },
    { v: "平账交易", k: "06" }
  ],
  // 处理状态
  tif_handle_state: [
    { v: "处理成功", k: "00" },
    { v: "处理失败", k: "01" },
    { v: "处理中", k: "02" }
  ],
  // 清算状态
  tif_clear_state: [
    { v: "实时清算", k: "0" },
    { v: "划拨清算", k: "1" },
    { v: "实时划拨清算", k: "2" }
  ],
  // 币种
  currency: [
    { v: "人民币", k: "1" },
    { v: "美元", k: "2" },
    { v: "港币", k: "3" },
    { v: "其他币种", k: "4" }
  ],
  // 环境
  env: [
    { v: "生产环境", k: "1" },
    { v: "测试环境", k: "2" },
    { v: "开发环境", k: "3" },
    { v: "UAT环境", k: "4" }
  ]
};
