var envConfig = {
  /* =============================== 本地开发环境配置 ============================== */
  dev: {
    base_url: 'dev',
    assetsUrl:'http://localhost:8800/',
    
  },
  /* =============================== fat环境配置 ================================= */
  fat: {
    base_url: 'fat',
    assetsUrl:''
  },
  /* =============================== uat环境配置 ================================= */
  uat: {
    base_url: 'uat'
  },
  /* =============================== prod环境配置 ================================ */
  prod: {
    base_url: 'prod'
  },
}
module.exports = envConfig;